cavityFlow/Re-10000/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

sets
(
    linhaA
    {
        type            lineCell;
        axis            distance;//x;
        start           (0    0.05  0.005);
        end             (0.1  0.05  0.005);
    }
    linhaB
    {
        type            lineCell;
        axis            distance;//y;
        start           (0.055 0   0.005);
        end             (0.055 0.1 0.005);
    }
);

fields
(
    U
);


// ************************************************************************* //
